CropBoxVisible Property
Whether or not the Crop Box/Region is visible for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool CropBoxVisible { get; set; }
Visual Basic
Public Property CropBoxVisible As Boolean
	Get
	Set
Visual C++
public:
property bool CropBoxVisible {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInapplicableDataException | Thrown when getting this property, if the view is a template and cannot have a crop box applied.
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when setting this property, if the view is a template and cannot have a crop box applied.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →